## Merging Data

In [18]:
import pandas as pd
df1= pd.DataFrame({"Name": ["Alice","Bob"], "Age": [25,30]})
df2= pd.DataFrame({"Name": ["Charlie","Diana"], "Age": [28,22]})

In [12]:
df3 = pd.concat([df1, df2], ignore_index=False)
df3

      Name  Age
0    Alice   25
1      Bob   30
0  Charlie   28
1    Diana   22

In [15]:
df3 = pd.DataFrame({"city":["Paris", "London"]})
pd.concat([df1, df3],axis = 1)

    Name  Age    city
0  Alice   25   Paris
1    Bob   30  London

In [30]:
df1= pd.DataFrame({"Name": ["Alice","Bob","David"], "Age": [25,30,28]})
df2= pd.DataFrame({"Name": ["Charlie","Diana","Smith"], "Age": [28,22,30]}) 
df1, df2

(    Name  Age
 0  Alice   25
 1    Bob   30
 2  David   28,
       Name  Age
 0  Charlie   28
 1    Diana   22
 2    Smith   30)

In [31]:
df2

      Name  Age
0  Charlie   28
1    Diana   22
2    Smith   30

In [32]:
pd.concat([df1,df2],ignore_index=True)

      Name  Age
0    Alice   25
1      Bob   30
2    David   28
3  Charlie   28
4    Diana   22
5    Smith   30

In [36]:
import pandas as pd
import numpy as np 

# sample data with an outliner
data = pd.Series([10,12,13,14,15,100])
Q1 = data.quantile(0.25)
Q3 = data.quantile(0.75)
IQR = Q3 - Q1
upper_bound = Q3 + 1.5 * IQR
lower_bound = Q1 - 1.5 * IQR

outliners = data[(data < lower_bound) | (data > upper_bound)]
outliners

5    100
dtype: int64

In [ ]:
import pandas as pd
import numpy as np 

df["A"].Isnull().sun()

YO

In [39]:
df1

    Name  Age
0  Alice   25
1    Bob   30
2  David   28